backend/app/controllers/api/v1/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
      def index
        @categories = Category.all.order(:name)

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ('Residential', '2026-01-20 16:34:24.086560', '2026-01-20 16:34:24.086560') RETURNING "id"
---
      def create
        @category = Category.new(category_params)

        if @category.save

UPDATE "categories" SET "name" = 'Updated Category Name', "updated_at" = '2026-01-22 18:39:01.763494' WHERE "categories"."id" = '04efa9f9-d77f-4c53-b8dd-f705fb40d735'
---
      def update
        if @category.update(category_params)