backend/app/controllers/api/v1/contact_infos_controller.rb

      def update
        @contact_info = ContactInfo.instance

        if @contact_info.update(contact_info_params)
---
UPDATE "contact_infos" SET "email" = 'contact@example.com', "address" = '123 Business Street, City, State 12345', "hours" = 'Monday-Friday: 9AM-5PM, Saturday: 10AM-2PM', "updated_at" = '2026-01-21 17:43:15.114845' WHERE "contact_infos"."id" = 'a7fb38fe-1d43-47e1-a7d2-db5648cc1939'