backend/app/controllers/api/v1/inquiries_controller.rb

      def index
        @inquiries = Inquiry.includes(:property).recent
---
SELECT "properties".* FROM "properties" ORDER BY "properties"."created_at" DESC
SELECT "inquiries".* FROM "inquiries" ORDER BY "inquiries"."created_at" DESC

      def create
        @inquiry = Inquiry.new(inquiry_params)

        if @inquiry.save
---
INSERT INTO "inquiries" ("property_id", "name", "email", "phone", "message", "created_at", "updated_at") VALUES ('6fa299a7-557e-4263-861e-7e7b06468ebf', 'John Doe', 'john.doe@example.com', '+1234567890', 'I''m interested in this property. Please contact me.', '2026-01-20 21:36:25.737293', '2026-01-20 21:36:25.737293') RETURNING "id"

      def set_inquiry
        @inquiry = Inquiry.find(params[:id])
---
SELECT "inquiries".* FROM "inquiries" WHERE "inquiries"."id" = 'e5de832e-c5d8-4b73-85b8-020cc804e119' LIMIT 1