backend/app/controllers/api/v1/properties_controller.rb

      def index
        @properties = Property.includes(:property_images, :category)

        # Apply filters
        @properties = @properties.available if params[:available] == 'true'
        @properties = @properties.featured if params[:featured] == 'true'
        @properties = @properties.by_type(params[:property_type]) if params[:property_type].present?
        @properties = @properties.by_location(params[:location]) if params[:location].present?
        @properties = @properties.by_price_range(params[:min_price], params[:max_price]) if params[:min_price].present? || params[:max_price].present?

        @properties = @properties.order(created_at: :desc)
---
SELECT "properties".* FROM "properties" ORDER BY "properties"."created_at" DESC
SELECT "property_images".* FROM "property_images" WHERE "property_images"."property_id" IN ('870a2da6-e9a6-4a1f-a546-bfab20e6d365', 'bc50aece-daeb-4b42-b206-4ab7eaf3a4ca', 'e15bf81a-e9c5-4541-b850-09a79f0e18b8', '121c7b3a-a2ab-4501-9a9f-4871f1e6b1ce', '7e029baa-78f7-478e-9128-8545b75c8c1c', '7e80251b-1be4-4b88-80c7-e7a595ecde54')
SELECT "property_images".* FROM "property_images" WHERE "property_images"."property_id" = 'e7c1f5e8-3a00-405d-85f5-78f31f56b00a'

      def create
        @property = Property.new(property_params)
        @property.admin_user = current_admin_user

        if @property.save
---
INSERT INTO "properties" ("title", "description", "address", "price", "bedrooms", "bathrooms", "area", "property_type", "status", "featured", "admin_user_id", "category_id", "created_at", "updated_at") VALUES ('Beautiful Modern House', 'Spacious 3-bedroom house with modern amenities', '123 Main Street, Downtown', 350000.0, 3, 2, 2000.0, 'house', 'available', TRUE, '2486b80d-39f1-4e2f-ba13-95aa7ca86e3b', NULL, '2026-01-20 16:30:11.498901', '2026-01-20 16:30:11.498901') RETURNING "id"

      def update
        if @property.update(property_params)
---
UPDATE "properties" SET "title" = 'Updated Property Title', "price" = 375000.0, "status" = 'pending', "updated_at" = '2026-01-20 16:32:49.316183' WHERE "properties"."id" = 'd8620e04-ccae-44f2-bbe1-5022465cee18'

      def destroy
        @property.destroy
---
DELETE FROM "properties" WHERE "properties"."id" = '870a2da6-e9a6-4a1f-a546-bfab20e6d365'

      def upload_image
        if params[:image].blank?
          return render json: { error: 'No image provided' }, status: :unprocessable_entity
        end

        property_image = @property.property_images.build(
          is_primary: @property.property_images.empty? || params[:is_primary] == 'true'
        )
        property_image.image.attach(params[:image])

        if property_image.save
---
SELECT "property_images".* FROM "property_images" WHERE "property_images"."property_id" = '870a2da6-e9a6-4a1f-a546-bfab20e6d365'
SELECT 1 AS one FROM "property_images" WHERE "property_images"."property_id" = 'e7c1f5e8-3a00-405d-85f5-78f31f56b00a' LIMIT 1
INSERT INTO "property_images" ("property_id", "is_primary", "image_url", "blob_url", "created_at", "updated_at") VALUES ('e7c1f5e8-3a00-405d-85f5-78f31f56b00a', TRUE, NULL, NULL, '2026-01-12 15:55:25.473841', '2026-01-12 15:55:25.473841') RETURNING "id"

      def set_property
        @property = Property.find(params[:id])
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = 'e7c1f5e8-3a00-405d-85f5-78f31f56b00a' LIMIT 1