backend/app/controllers/api/v1/property_images_controller.rb

DELETE FROM "property_images" WHERE "property_images"."id" = 'b3881705-c19d-4aa3-9499-1bc359ea052d'
---
      def destroy
        @property_image.destroy

SELECT "property_images".* FROM "property_images" WHERE "property_images"."id" = '6fa299a7-557e-4263-861e-7e7b06468ebf' LIMIT 1
---
      def set_property_image
        @property_image = PropertyImage.find(params[:id])